In [1]:
import pandas as pd

In [33]:
titles_df = pd.read_csv("titles.csv")
titles_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [28]:
titles_df[titles_df["title_id"].duplicated() == True].count() # use title_id as PK

title_id    0
title       0
dtype: int64

In [5]:
departments_df = pd.read_csv("departments.csv")
departments_df.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [24]:
departments_df[departments_df["dept_no"].duplicated() == True].count() # use dept_no as PK

dept_no      0
dept_name    0
dtype: int64

In [6]:
dept_emp_df = pd.read_csv("dept_emp.csv")
dept_emp_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [29]:
dept_emp_df[dept_emp_df[["emp_no", "dept_no"]].duplicated() == True].count() # use both columns for PK

emp_no     0
dept_no    0
dtype: int64

In [7]:
dept_manager_df = pd.read_csv("dept_manager.csv")
dept_manager_df.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [30]:
dept_manager_df[dept_manager_df["emp_no"].duplicated() == True].count() # use emp_no as PK

dept_no    0
emp_no     0
dtype: int64

In [8]:
employees_df = pd.read_csv("employees.csv")
employees_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

In [34]:
employees_df[employees_df["emp_no"].duplicated() == True].count() # use emp_no as PK

emp_no          0
emp_title_id    0
birth_date      0
first_name      0
last_name       0
sex             0
hire_date       0
dtype: int64

In [9]:
salaries_df = pd.read_csv("salaries.csv")
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [31]:
salaries_df[salaries_df["emp_no"].duplicated() == True].count() # use emp_no as PK

emp_no    0
salary    0
dtype: int64